erp3l/src/Catalogs/УдалитьЭтапыПроцессов/УдалитьЭтапыПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УдалитьЭтапыПроцессов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ШаблоныПроцессов</owners>
  <attributes>
    <name>ТипОрганизацийЭтапа</name>
    <type>
      <types>EnumRef.ТипыОрганизационныхЕдиниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсуществлятьРассылкуПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСверкиВГО</name>
    <type>
      <types>CatalogRef.ШаблоныСверкиВГО</types>
    </type>
  </attributes>
  <attributes>
    <name>КритерийУтвержденияЭтапа</name>
    <type>
      <types>EnumRef.КритерииУтвержденияЭтапаПроцесса</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОрганизационныеЕдиницыОтбор</name>
    <attributes>
      <name>ОрганизационнаяЕдиница</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьИерархию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отбор</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтборПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтборТекстЗапроса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОрганизационныеЕдиницыПараметрыОтбора</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.ВидыОрганизационныхЕдиниц</types>
        <types>EnumRef.МетодыКонсолидации</types>
        <types>CatalogRef.Валюты</types>
        <types>CatalogRef.СтраныМира</types>
        <types>EnumRef.ТипыОрганизационныхЕдиниц</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПользователейПолучающихУведомление</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Утверждающие</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РолиКонтактныхЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормируемыеДокументы</name>
    <attributes>
      <name>ДокументБД</name>
      <type>
        <types>CatalogRef.ДокументыБД</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонДокумента</name>
      <type>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользоватьМногопоточность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрольный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>EnumRef.ВидыДокументовЭтапа</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>EnumRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>EnumRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>EnumRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыПредшественники</name>
    <attributes>
      <name>ЭтапПроцесса</name>
      <type>
        <types>CatalogRef.УдалитьЭтапыПроцессов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/УдалитьЭтапыПроцессов/ObjectModule.bsl
//	ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ПроверитьВозможностьЗаписи(Отказ, Сообщать = Ложь, ЗаголовокОшибки = "") Экспорт
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Если Справочники.ШаблоныПроцессов.ЕстьОткрытыеПроцессы(Владелец,Ссылка) Тогда
		
		Если Сообщать Тогда
			ОбщегоНазначенияУХ.СообщитьОбОшибке("- по шаблону """ + Владелец + """ уже существуют открытые процессы!", Отказ, ЗаголовокОшибки);
		Иначе
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//	ПРОЦЕДУРЫ И ФУНКЦИИ, ВЫЗЫВАЕМЫЕ ИЗ ОБРАБОТЧИКОВ

Процедура ПроверитьПередЗаписью(Отказ, ЗаголовокОшибки)
	
	ПроверитьВозможностьЗаписи(Отказ, Истина, ЗаголовокОшибки);
	
	Если НЕ ЭтоГруппа И ТипОрганизацийЭтапа = Перечисления.ТипыОрганизационныхЕдиниц.Обычная Тогда
		
		Для Каждого СтрокаПредшественника Из ЭтапыПредшественники Цикл
			Если НЕ СтрокаПредшественника.ЭтапПроцесса.ТипОрганизацийЭтапа = Перечисления.ТипыОрганизационныхЕдиниц.Обычная Тогда
				ОбщегоНазначенияУХ.СообщитьОбОшибке("Этапу с типом организационных единиц ""Обычная"" - Тип этапа-предшественника """ + СтрокаПредшественника.ЭтапПроцесса + """ не соответствует типу организаций этапа!", Отказ, ЗаголовокОшибки);
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры 


//	ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаголовокОшибки = "Этап процесса: """ + ЭтотОбъект + """ не может быть записан:";
	
	ПроверитьПередЗаписью(Отказ, ЗаголовокОшибки);
	
	Если НЕ Отказ Тогда
		ОбщегоНазначенияУХ.УстановитьНовыйПорядковыйНомерПриНеобходимости(ЭтотОбъект);
	КонецЕсли; 
	
	//Для Каждого Строка Из ФормируемыеДокументы Цикл
	//	Если ТипЗнч(Строка.ШаблонДокумента) = Тип("СправочникСсылка.ДокументыБД") Тогда
	//		Строка.ДокументБД = Строка.ШаблонДокумента;
	//	Иначе
	//		Строка.ДокументБД = УправлениеДокументамиБДУХ.ПолучитьВидДокументаБДПоШаблону(Строка.ШаблонДокумента);
	//	КонецЕсли;
	//КонецЦикла; 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ПорядковыйНомер = 0;
	
	Соответствие = Новый Соответствие;
	
	Для Каждого СтрокаПараметров Из ОрганизационныеЕдиницыПараметрыОтбора Цикл
		НовоеИмяПараметра = Соответствие.Получить(СтрокаПараметров.Имя);
		Если НовоеИмяПараметра = Неопределено Тогда
			НовоеИмяПараметра = Справочники.УдалитьЭтапыПроцессов.ПолучитьУникальноеИмяПараметраПоУникальномуИмениПараметра(СтрокаПараметров.Имя);
			Соответствие.Вставить(СтрокаПараметров.Имя, НовоеИмяПараметра);
		КонецЕсли;
		СтрокаПараметров.Имя = НовоеИмяПараметра;
	КонецЦикла;
	
	Для Каждого СтрокаОтбора Из ОрганизационныеЕдиницыОтбор Цикл
		Для Каждого КлючЗначение Из Соответствие Цикл
			СтрокаОтбора.ОтборТекстЗапроса = СтрЗаменить(СтрокаОтбора.ОтборТекстЗапроса, "&"+КлючЗначение.Ключ, "&"+КлючЗначение.Значение);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
